console.log('number' + 3 + 3); // отримуємо рядок, тому що 'number' - це строка і тут іде конкатенація
console.log(null + 3); // отримуємо число, тому що null = 0
console.log(5 && "qwerty"); // отримуємо строку, тому що оператор && виводить останнє значення, якщо всі значення true
console.log(+'40' + +'2' + "hillel"); // отримуємо рядок, тому що робимо конкатенацію строк
console.log('10' - 5 === 6); // отримуємо false, тому що порівнюємо числа і 5 не дорівнює 6
console.log(true + false); // отримуємо 1, тому що булеві значення конвертувалися в числа
console.log('4px' - 3); // отримуємо NaN, тому що від строки пробуємо відняти число
console.log('4' - 3); // отримуємо число, тому що строка '4' при відніманні перетворилася в число
console.log('6' + 3 ** 0); // отримуємо строку, тому що строка '6' додається до одиниці
console.log(12 / '6'); // отримуємо число, строка '6' конвертувалась в число при діленні
console.log('10' + (5 === 6)); // отримуємо строку, булеве значення додалось до строки '10'
console.log(null == ''); // отримуємо булеве значення, тому що йде порівняння
console.log(3 ** (9 / 3)); // отримуємо число, тому що тут операції з числами
console.log(!!'false' == !!'true'); // отримуємо булеве значення, тому що строки конвертувались в булеві значення
console.log(0 || '0' && 1); // отримуємо один, тому що при 0 || 1 отримуємо 1(true)
console.log((+null == false) < 1); // отримуємо булеве значення false, тому що одиниця не більша за одиницю
console.log(false && true || true); // отримуємо true, тому що оператор || виводить true в такому виразі: false || true
console.log(false && (false || true)); // оримуємо false, тому що false && true дає нам false
console.log((+null == false) < 1 ** 5); // отримуємо булеве значення false, тому що одиниця не більша за одиницю